# Upload The Data That You Wnat To Work With It

In [16]:
import pandas as pd 
df = pd.read_csv(r"C:\Users\LENOVO\Downloads\pandas_exercise_big_dataset.csv")
print(df.head())

     name  age     city  score
0    Zane   20  Seattle     76
1   Quinn   40       LA     79
2  Victor   55       NY     78
3    Omar   40  Seattle     91
4    Nora   28  Houston     69

# Find the average score of all people

In [17]:
average_score = df["score"].mean()
print(average_score)

78.64

# Find the oldest person’s name and age

In [18]:
oldest_row = df.loc[df["age"].idxmax()]

print(oldest_row["name"], oldest_row["age"])

Zane 58

# Determine how many people live in each city

In [19]:
city_counts = df["city"].value_counts()
print(city_counts.to_string())

city
NY         10
Seattle     8
Chicago     8
LA          7
Houston     7
Boston      6
Miami       4

# Filter the dataset to only include rows where score ≥ 90

In [20]:
high_scores = df[df["score"] >= 90]
high_scores

      name  age     city  score
3     Omar   40  Seattle     91
6     Zane   58  Chicago     91
11   Alice   43    Miami     96
20  Victor   45  Houston     98
21    Lina   47       NY     98
23     Uma   49       LA     92
28    Evan   45       NY     98
29   Paula   33   Boston     94
41    Dina   37       NY     94
45   Quinn   37   Boston     96
46    Evan   22       LA     93
49    Dina   25   Boston    100

# Add a new column called “age_group”:

# "young" if age < 25

# "adult" if 25 ≤ age < 35

# "senior" if age ≥ 35

In [21]:
def age_group(age):
    if age < 25:
        return "young"
    elif age < 35:
        return "adult"
    else:
        return "senior"

df["age_group"] = df["age"].apply(age_group)
df.head()

     name  age     city  score age_group
0    Zane   20  Seattle     76     young
1   Quinn   40       LA     79    senior
2  Victor   55       NY     78    senior
3    Omar   40  Seattle     91    senior
4    Nora   28  Houston     69     adult